{
  "version": "https://jsonfeed.org/version/1",
  "title": "edibotopic",
  "home_page_url": "https://edibotopic.com/",
  "feed_url": "https://example.com/feed/feed.json",
  "description": "Writing and projects relating to food technology and philosophy.",
  "author": {
    "name": "Shane Crowley",
    "url": "https://github.com/edibotopic/"
  },
  "items": [{
      "id": "https://edibotopic.com/posts/2022-06-26-site-migrated/",
      "url": "https://edibotopic.com/posts/2022-06-26-site-migrated/",
      "title": "Moving from WordPress to GitHub",
      "content_html": "<style>\n  p>img {\n    margin: auto;\n  }\n</style>\n<p>I made a website when my academic job began to require more online teaching. The idea was to craft a space for exploring my personal and scholarly interests in a more integrated and informal way. Under time pressure, with little programming experience and a minimal amount of research, I chose <em>WordPress</em> as a publishing platform. This choice made it quick and easy to get a functioning site up-and-running, but creating the content soon became a chore. In parallel, I became a more proficient user of GitHub. For every incomplete blog post there was a new software project in a GitHub repository. For these and other reasons I have decided to migrate the website to GitHub. This post serves to outline my motivations and get this blog started.</p>\n<!-- TODO add links -->\n<h3 id=\"why-a-website%3F\" tabindex=\"-1\"><strong>Why a Website?</strong> <a class=\"header-anchor\" href=\"#why-a-website%3F\">\n                  <span class=\"direct-link\" aria-hidden=\"true\">#</span>\n                    </a></h3>\n<p>I developed a <em>somewhat</em> undeserved reputation as a “tech person” among my university colleagues during the era of Covid lockdowns. Admittedly, it was a period of frantic digital exploration. I sunk countless hours into music, programming and 3D design, among other activities. This was partially motivated by a sense of deep panic: having previously been an <em>occasionally</em> boring lecturer in some of my in-person classes, how could I now avoid giving boring online lectures? The blurry ambition was to model myself on the content creators that I had come to recognise as <em>effective</em> teachers (at least for me <em>personally</em>). There were plans for Youtube videos, personal blogs, bespoke soundtracks, software tools for teaching and a food-themed podcast. <em>Some</em> of these things materialised, and of those that <em>did</em> the website was probably the least successful.</p>\n<p>The original <a href=\"https://edibotopic.com\">edibotopic.com</a> — in some way — was an attempt to (re)integrate aspects of my own personality that had been cut adrift during the intense and specialised work characteristic of early-stage academia. My pre-academic life was defined mostly by writing <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mo>+</mo></mrow><annotation encoding=\"application/x-tex\">+</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.66666em;vertical-align:-0.08333em;\"></span><span class=\"mord\">+</span></span></span></span> music (creatively) and sport <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mo>+</mo></mrow><annotation encoding=\"application/x-tex\">+</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.66666em;vertical-align:-0.08333em;\"></span><span class=\"mord\">+</span></span></span></span> gaming (casually). If the creative projects were materially <em>unsuccessful</em> and the casual hobbies pleasant <em>distractions</em> they were still rewarding. During the initial years in my academic position (<em>in food science</em>) I earned a philosophy degree — much to the confusion of my colleagues — adding another node in my web of interests. I believe there are many productive and enlightening connections to be made between ideas across different domains of human knowledge, and I needed a place to explore these connections when the structures of academia did not make that possible.</p>\n<h3 id=\"bad-friction\" tabindex=\"-1\"><strong>Bad Friction</strong> <a class=\"header-anchor\" href=\"#bad-friction\">\n                  <span class=\"direct-link\" aria-hidden=\"true\">#</span>\n                    </a></h3>\n<p><a href=\"https://wordpress.org\">WordPress</a> is often recommended to beginners who want to make a website. It has a lot to offer. Choose a name, choose a theme and you’re on your way. There is a large ecosystem of <strong>plugins</strong>, which is also very attractive. For example, I was exploring the <a href=\"https://www.babylonjs.com/\">Babylon.js</a> game engine for making 3D content for the web and WordPress had a plugin for displaying those scenes. I thought that people might comment on my blog posts and there was a plugin for handling those user interactions. <em>What if someone wanted to make a donation</em> I thought and — sure enough — there was a plugin for that too.</p>\n<p>Later, I began to find these plugins more troublesome for a few reasons:</p>\n<ol>\n<li>\n<p>Some of the features these plugins add are relatively trivial to implement in a standard website, <em>if</em> you know what you’re doing. How they often seem to function on WordPress is overcoming the constraints imposed by WordPress itself. Adding interactivity (through scripts) or styling (through CSS) is routine practice when tweaking a website but it is decidedly <em>awkward</em> on WordPress. Plugins overcome this awkwardness but at a cost.</p>\n</li>\n<li>\n<p>Plugins often reduce site performance. Say you want to add support for a photo gallery. As a beginner, you might find some code samples online where this feature is implemented in a few lines of JavaScript and CSS. WordPress, however, makes it difficult to add the necessary code. So, someone recommends a gallery plugin, which you then install. Several weeks later you notice a dip in site performance. The common practice at this point is to uninstall each plugin one-by-one to identify the root cause. Even if this time-consuming, iterative process leads you to identify the culprit you are then left with the hard decision of whether to cull the offending plugin(s) to benefit performance, or sacrifice that performance for the desired functionality.</p>\n</li>\n<li>\n<p>The plugin ecosystem is very much a <em>marketplace</em>. You will be surprised to find that seemingly basic features are behind a paywall. You will be prompted for reviews. Your choice to stop using a plugin will be queried. The creators of these plugins are entitled to seek feedback and remuneration for their efforts but if you are using multiple plugins this process can add unnecessary friction to the simple act of writing a blog post.</p>\n</li>\n<li>\n<p>Many of the plugins that are attractive may not be necessary for meagre use-cases like my own. Writing blogs about niche academic topics was unlikely to attract donations. People were probably not going to fall in love having first met each other in the comments section of one of my blog posts. The ease with which you can add functionalities like these ones can very easily lead to you overpowering your website.</p>\n</li>\n<li>\n<p>The answer to these problems is often simply to “use less plugins”, but if the diversity and easy-implementation of plugins were what attracted you in the first place then a major benefit of the platform seems to be undermined by this line of reasoning.</p>\n</li>\n</ol>\n<p>All this I know with the benefit of hindsight. The “trivial implementations” I refer to were not trivial for me <em>at the time</em>. I did not know what functionality my site would require. In retrospect, I could only ever have started with a tool like WordPress and if I had more complex requirements (e-commerce) then maybe I never would have left. I had chosen <code>wordpress.org</code> as opposed to <code>wordpress.com</code> as the former seemed to offer more immediate possibilities for customisation. This required me to <strong>pay for web hosting</strong>. Similar functionality can be accessed in the <code>.com</code> option if you enter one of <a href=\"http://WordPress.com\">WordPress.com</a>’s <strong>paid tiers</strong>. While I was <em>paying</em> a significant amount of money for a website that was painful to customise and maintain, my <a href=\"https://github.com/edibotopic\">GitHub profile</a> swelled with freely-hosted web applications.</p>\n<p>The alternative for <em>me-as-beginner</em> was building a site from scratch or using a static site generator. These options were beyond my skill-set at the time, or at least beyond my capacity to understand what I was directly manipulating when building the site. So I maintained my unproductive blog, which largely involved the drudgery of updating plugins to prevent security problems. At the same time I was increasingly productive with small software projects on GitHub. Creating these projects on GitHub was <em>more difficult</em> on its face (it involved actual coding), yet it was where I seemed to be making the most ground.</p>\n<h3 id=\"the-decision-to-change\" tabindex=\"-1\"><strong>The Decision to Change</strong> <a class=\"header-anchor\" href=\"#the-decision-to-change\">\n                  <span class=\"direct-link\" aria-hidden=\"true\">#</span>\n                    </a></h3>\n<p>My personal grievances with WordPress came to head when I was writing my final blog post, which was a summary of some recent software projects.</p>\n<p>In the intervening years I had become a fan of editing plain text/markdown using (Neo)Vim as my text editor. I would then copy the text and paste it into the WordPress editor. Inevitably this would cause unforeseen formatting issues that would take a considerable amount of time to fix. I had enabled markdown editing in WordPress <em>via</em> a plugin but the post still came out jumbled. I had specific, enraging problems with adding a code block, a feature common to most markdown editors/previewers that looks like this:</p>\n<pre class=\"language-javascript\"><code class=\"language-javascript\"><span class=\"token comment\">// code goes here</span><br><span class=\"token keyword\">let</span> a <span class=\"token operator\">=</span> <span class=\"token number\">2</span><br><span class=\"token keyword\">let</span> b <span class=\"token operator\">=</span> <span class=\"token number\">6</span><br><br>console<span class=\"token punctuation\">.</span><span class=\"token function\">log</span><span class=\"token punctuation\">(</span>b <span class=\"token operator\">/</span> a<span class=\"token punctuation\">)</span><br><span class=\"token comment\">// returns 3</span></code></pre>\n<p>I ended up installing three different plugins before I found something that worked and the results <em>still</em> looked bad. Due to these and other issues, every time I sat down to write something there was a little bit of dread associated with the publishing stage. As writing is already difficult enough, the (bad) friction introduced by the WordPress editor was a problem.</p>\n<h3 id=\"good-friction\" tabindex=\"-1\"><strong>Good Friction</strong> <a class=\"header-anchor\" href=\"#good-friction\">\n                  <span class=\"direct-link\" aria-hidden=\"true\">#</span>\n                    </a></h3>\n<p>Plain text. The terminal. Text editors. Version control.</p>\n<p>Terms that are superficially bland but that are known to excite many programmers. Like most <em>non-programmers</em>, I was originally mystified as to why these were interesting or useful, not to mind <em>exciting</em>. I gradually came to understand their appeal, and I hope to discuss these topics in more depth in future posts. For now, it is enough to say that I greatly value the customisability and speed of a good text editor, as well as the structured and transparent nature of a version-controlled project. When creating material for a website I wanted to leverage these tools. Like <a href=\"https://noelle.dev/meta/about\">others before me</a> I decided to make the switch from WordPress to a static site generator.</p>\n<p>This website took longer to setup than if I was using WordPress. Like most static site generators the idea is simple: to take content written in markdown and convert it into web pages. The site is <em>static</em> as opposed to <em>dynamic</em> because I want to show all users the same content rather than tailor the site based on data from individual users — as a result, the static version of <a href=\"https://edibotopic.com\">edibotopic.com</a> is faster then the dynamic WordPress version and I am prevented from adding annoying/unnecessary features that “personalise” the user experience. Most of my interaction with the site should basically proceed as follows:</p>\n<ol>\n<li>Open a terminal</li>\n<li>Write <code>.md</code> file</li>\n<li>Run <code>npm run build</code></li>\n<li><code>Push</code> changes to GitHub</li>\n</ol>\n<p>The markdown is a straightforward way of formatting text:</p>\n<pre class=\"language-markdown\"><code class=\"language-markdown\"><span class=\"token title important\"><span class=\"token punctuation\">###</span> Good Friction</span><br><br>Plain text. The terminal...<br><br>Terms that are...<br><br><span class=\"token list punctuation\">1.</span> Open terminal<br><span class=\"token list punctuation\">2.</span> Write markdown...<br><br>The markdown is a straightforward way of formatting text:</code></pre>\n<p>The <code>build</code> process, however, involves multiple interacting parts:</p>\n<ul>\n<li><strong>Site generator</strong>: eleventy</li>\n<li><strong>Bundler</strong>: Vite</li>\n<li><strong>Markdown parser</strong>: markdown-it</li>\n<li><strong>CSS tools/frameworks</strong>: tailwind, PostCSS</li>\n<li><strong>Package manager</strong>: NPM</li>\n</ul>\n<p>Besides obvious tasks like styling the website to my preferences, there were innumerable tiny problems to solve associated with these different parts.</p>\n<p>The original bundler had been deprecated so I had to migrate to Vite. List numbers/bullets were being rendered incorrectly and I needed to learn Tailwind configuration to fix them. Several issues were associated with outdated dependencies that needed to be updated or upgraded through <code>NPM</code>. My <em>production build</em> did not behave like my <em>development build</em> because of how GitHub handles relative paths.</p>\n<p>Even when addressing these issues took time the solution usually <em>made sense</em>, rather than being some <em>deus ex machina</em> in the form of a plugin. While I <em>do</em> use plugins on this site they are less abundant and often merely implement small adjustments to how an <code>.md</code> file is converted into <code>.html</code>.</p>\n<p>My major gripe with static site generators is how they appear <em>as a code base</em> to the uninitiated. In the other software projects I have worked on I like the idea that someone can look at the code and see a simple directory structure like so:</p>\n<pre><code>+--scripts\n+--styles\n+--index.html\n</code></pre>\n<p>Static site generators create relatively complex directory structures. In addition, different people use different JAM (JavaScript APIs Markup) <a href=\"https://jamstack.org/\">stacks</a>. While I use <a href=\"https://www.11ty.dev/\">Eleventy</a> another will use <a href=\"https://gohugo.io/\">Hugo</a>, with subtly different APIs, dependencies and directory structures in each case. If you like a feature of a static site and want to study it there can be a lot of detective work involved. From a pedagogical standpoint this is undesirable, especially if a prospective student is not already a web developer.</p>\n<p>Regardless, I needed something compact that I could manage and understand <em>if only in principle</em>. When something breaks it would be within my power to investigate and fix it, rather than endlessly searching forums for workarounds.</p>\n<p>While my instinct for colour schemes might not be perfect — you can be the judge — this site looks <em>at least as good</em> as the WordPress one to my eyes, and I am in more control of how that might change in the future.</p>\n<h3 id=\"the-current-plan\" tabindex=\"-1\"><strong>The Current Plan</strong> <a class=\"header-anchor\" href=\"#the-current-plan\">\n                  <span class=\"direct-link\" aria-hidden=\"true\">#</span>\n                    </a></h3>\n<p>Many people have a difficulty with <em>starting writing</em>, while I have a difficulty <em>stopping writing</em>. I have a natural tendency to write articles that are long, verbose and that try to do too much.</p>\n<ul>\n<li>\n<p><strong>Example 1</strong>: my final blog on the previous site, which attempted to summarise 6-7 software projects I had worked on. Of course, this could have simply been 6-7 shorter and more self-contained blog posts.</p>\n</li>\n<li>\n<p><strong>Example 2</strong>: this very post.</p>\n</li>\n</ul>\n<p>Coming from academia, I am also a prodigious editor. An article requiring 5 or even 12 drafts is <em>normal</em> to me. This, however, is not sustainable when maintaining a “casual” blog. The whole idea here is to write more freely and fluently, even if a post ends up on <em>Hacker News</em> and its exacting users decry the state of internet writing.</p>\n<p>A major goal of mine with this site is to write more regularly but also more concisely, with this blog perhaps being a bad start in that respect! In addition, it will function as a reference for my recent and active projects in music, software and technology. Lastly, if my nascent multimedia projects (video, podcasting) come to fruition then I will incorporate them into this site.</p>\n<p>More soon 😉</p>\n"
  ,
      "date_published": "2022-06-26T00:00:00Z"
    }
]
}
